In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('people_data.csv')
df.head()

   ID   Name   Age           City  Score
0   1  Alice  25.0       New York   85.5
1   2    Bob  30.0    Los Angeles   78.2
2   3    NaN  22.0  San Francisco   92.1
3   4  David  35.0        Chicago    NaN
4   5    Eve  28.0        Houston   88.9

In [3]:
df.tail()

     ID     Name   Age             City  Score
95   96     Paul  31.0              NaN   92.0
96   97  Queenie  29.0     Jacksonville   66.0
97   98      Rob  38.0  Fort Lauderdale   83.0
98   99   Sophie   NaN   San Bernardino   74.0
99  100      Tim  33.0           Tacoma   91.0

In [4]:
df.isnull

<bound method DataFrame.isnull of      ID     Name   Age             City  Score
0     1    Alice  25.0         New York   85.5
1     2      Bob  30.0      Los Angeles   78.2
2     3      NaN  22.0    San Francisco   92.1
3     4    David  35.0          Chicago    NaN
4     5      Eve  28.0          Houston   88.9
..  ...      ...   ...              ...    ...
95   96     Paul  31.0              NaN   92.0
96   97  Queenie  29.0     Jacksonville   66.0
97   98      Rob  38.0  Fort Lauderdale   83.0
98   99   Sophie   NaN   San Bernardino   74.0
99  100      Tim  33.0           Tacoma   91.0

[100 rows x 5 columns]>

In [13]:
n=input()

13

In [14]:
l=list(n) 
print(type(l))

<class 'list'>

In [15]:
l

['1', '3']

In [16]:
s=sum(l)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [ ]:
s